{
  "backend/main.mo": "Empty Motoko actor placeholder with no implemented logic.",
  "feature_evidence.json": "Feature evidence report mapping product features to source files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Text file containing short descriptions of various frontend components, hooks, and configuration files.",
  "frontend/index.css": "Defines Tailwind layers and OKLCH color variables for light and dark modes with global background and border styling.",
  "frontend/index.html": "HTML entry point that loads the React application via main.tsx.",
  "frontend/src/App.tsx": "Main app component handling navigation between dashboard, species selection, and settings within a dark theme.",
  "frontend/src/components/controls/BottomControlBar.tsx": "Touch-friendly control bar with buttons for manual turn, species menu, settings, and alarm mute.",
  "frontend/src/components/gauges/CircularGauge.tsx": "Animated SVG circular gauge showing a value with eased transitions, status colors, and optional alarm effects.",
  "frontend/src/components/help/HelpAboutPanel.tsx": "Help panel explaining kiosk mode setup, screen pinning, and auto‑start guidance for Android devices.",
  "frontend/src/components/layout/PanelLayout.tsx": "Layout wrapper providing optional header/footer and kiosk-mode-aware scrolling behavior.",
  "frontend/src/components/layout/ScreenTransition.tsx": "Wrapper adding smooth fade‑in transitions when screens change.",
  "frontend/src/components/species/SpeciesTileButton.tsx": "Large button showing a species icon and label for selection with optional loading state.",
  "frontend/src/hooks/useActor.ts": "React hook creating and managing an authenticated or anonymous backend actor with query invalidation on identity change.",
  "frontend/src/hooks/useEsp32Commands.ts": "Provides React Query mutations to send control commands to the ESP32 and handles success/error toasts and cache invalidation.",
  "frontend/src/hooks/useIncubatorStatus.ts": "Fetches incubator status from the ESP32 using React Query with polling and retry logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider for managing authentication state using Dfinity AuthClient.",
  "frontend/src/index.css": "Tailwind CSS setup defining color variables, themes, utilities, and animations for gauges and UI effects.",
  "frontend/src/lib/esp32Client.ts": "Defines a client for communicating with the ESP32 API, handling timeouts, errors, and endpoints for status and control commands.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and renders the main App component.",
  "frontend/src/screens/DashboardScreen.tsx": "Displays incubator metrics, connection status, controls, and gauges using live data and ESP32 command hooks.",
  "frontend/src/screens/SettingsScreen.tsx": "Provides UI for editing local settings and sending temperature and humidity updates to the ESP32.",
  "frontend/src/screens/SpeciesSelectionScreen.tsx": "Renders the species selection UI with preset species icons and sends a mode change to the ESP32 before navigating back to the dashboard. Uses SpeciesTileButton components and a back button within a panel layout.",
  "frontend/src/state/useKioskMode.ts": "Provides a hook to read and persist kiosk-mode state in localStorage. Exposes the current mode and a setter.",
  "frontend/src/state/useLocalSettings.ts": "Manages incubation-related local settings with defaults, loading and saving them to localStorage. Offers an update function for partial settings changes.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors, typography, animations, and plugins for container queries, typography, and animation. Extends theme tokens for UI consistency.",
  "project_state.json": "Defines project metadata, requirements, features, and image needs for an ESP32‑controlled incubator touchscreen app. Stores versioned state, architectural notes, and feature list."
}